Tekla.Structures.TeklaStructuresSettings.SetOptions(Tekla.Structures.ClashCheckOptions)
Sets the clash check options.
Options: The clash check options to be set.
Returns: True if the clash check options were successfully set.

Tekla.Structures.TeklaStructuresSettings.GetOptions(Tekla.Structures.ComponentOptions@)
Returns the value of the component options.
Options: The returned value of the component options.
Returns: True if the values were successfully retrieved.

Tekla.Structures.TeklaStructuresSettings.SetOptions(Tekla.Structures.ComponentOptions)
Sets the component options.
Options: The component options to be set.
Returns: True if the component options were successfully set.